
<!DOCTYPE HTML>
<html lang="fa" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>ساختمان داده؟؟؟ · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="چیزی برای جستجو بنویسید" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    ساختمان داده ها به زبون آدمیزاد
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="WHYDS.html">
            
                <a href="WHYDS.html">
            
                    
                    ساختمان داده؟؟؟
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            انتشار یافته توسط GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >ساختمان داده؟؟؟</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646;-&#x62F;&#x627;&#x62F;&#x647;&#x61F;&#x61F;&#x61F;">&#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x647;&#x61F;&#x61F;&#x61F;</h3>
<blockquote>
<p>&#x648;&#x6CC;&#x6A9;&#x6CC; &#x67E;&#x62F;&#x6CC;&#x627; &#x645;&#x6CC;&#x6AF;&#x647;: &#xAB;&#x633;&#x627;&#x632;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x646; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627; &#x628;&#x647; &#x6CC;&#x6A9; &#x637;&#x631;&#x6CC;&#x642; &#x62E;&#x627;&#x635; &#x648; &#x628;&#x631; &#x67E;&#x627;&#x6CC;&#x647; &#x645;&#x62F;&#x644; &#x645;&#x646;&#x637;&#x642;&#x6CC; &#x6CC;&#x627; &#x631;&#x6CC;&#x627;&#x636;&#x6CC; &#x6A9;&#x647; &#x628;&#x647; &#x645;&#x646;&#x638;&#x648;&#x631; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x628;&#x647;&#x6CC;&#x646;&#x647; &#x627;&#x632; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627; &#x635;&#x648;&#x631;&#x62A; &#x645;&#x6CC; &#x6AF;&#x6CC;&#x631;&#x62F; &#x631;&#x627; &#x6CC;&#x6A9; &#x62F;&#x627;&#x62F;&#x647; &#x633;&#x627;&#x62E;&#x62A;&#x627;&#x631; &#x645;&#x6CC; &#x6AF;&#x648;&#x6CC;&#x646;&#x62F;.&#xBB;</p>
</blockquote>
<h4 id="&#x686;&#x631;&#x627;-&#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646;-&#x62F;&#x627;&#x62F;&#x647;&#x61F;&#x61F;&#x61F;">&#x686;&#x631;&#x627; &#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x647;&#x61F;&#x61F;&#x61F;</h4>
<p><strong>&#x62C;&#x648;&#x627;&#x628; &#x6A9;&#x648;&#x62A;&#x627;&#x647;:</strong> &#x686;&#x631;&#x627; &#x646;&#x647;&#x61F;&#x61F;&#x61F; (:</p>
<p><strong>&#x62C;&#x648;&#x627;&#x628; &#x628;&#x644;&#x646;&#x62F;:</strong> &#x62F;&#x646;&#x6CC;&#x627;&#x6CC; &#x627;&#x645;&#x631;&#x648;&#x632;&#x60C; &#x62F;&#x646;&#x6CC;&#x627;&#x6CC; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627;&#x633;&#x62A;! &#x646;&#x6CC;&#x627;&#x632; &#x62F;&#x627;&#x631;&#x6CC;&#x645; &#x628;&#x627; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627; &#x6A9;&#x627;&#x631; &#x6A9;&#x646;&#x6CC;&#x645;. &#x627;&#x632; &#x637;&#x631;&#x641;&#x6CC; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627; &#x631;&#x648;&#x632; &#x628;&#x647; &#x631;&#x648;&#x632; &#x62D;&#x62C;&#x6CC;&#x645; &#x62A;&#x631; &#x645;&#x6CC;&#x634;&#x646;&#x62F; &#x648; &#x628;&#x627;&#x6CC;&#x62F; &#x637;&#x648;&#x631;&#x6CC; &#x633;&#x627;&#x632;&#x645;&#x627;&#x646; &#x62F;&#x647;&#x6CC;&#x200C;&#x634;&#x648;&#x646; &#x6A9;&#x646;&#x6CC;&#x645; &#x62A;&#x627; &#x628;&#x62A;&#x648;&#x646;&#x6CC;&#x645; &#x628;&#x631;&#x627;&#x633;&#x627;&#x633; &#x646;&#x6CC;&#x627;&#x632; &#x628;&#x647; &#x633;&#x647; &#x62A;&#x627; &#x641;&#x627;&#x6A9;&#x62A;&#x648;&#x631; &#x627;&#x633;&#x627;&#x633;&#x6CC; &#x62C;&#x648;&#x627;&#x628; &#x628;&#x62F;&#x6CC;&#x645;:</p>
<ol>
<li>&#x633;&#x631;&#x639;&#x62A; </li>
<li>&#x647;&#x632;&#x6CC;&#x646;&#x647; </li>
<li>&#x642;&#x627;&#x628;&#x644; &#x627;&#x645;&#x6A9;&#x627;&#x646; &#x628;&#x648;&#x62F;&#x646;</li>
</ol>
<p>&#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x628;&#x6AF;&#x645;&#x61F;&#x61F;&#x61F;
<br>
&#x645;&#x62B;&#x644;&#x627; &#x642;&#x631;&#x627;&#x631;&#x647; &#x628;&#x647; &#x6CC;&#x6A9; &#x62C;&#x627;&#x6CC; &#x62F;&#x648;&#x631; &#x633;&#x641;&#x631; &#x6A9;&#x646;&#x6CC;&#x645;&#x61B; &#x6A9;&#x644;&#x6CC; &#x631;&#x648;&#x634; &#x648;&#x627;&#x633;&#x647; &#x633;&#x641;&#x631; &#x6A9;&#x631;&#x62F;&#x646; &#x647;&#x645; &#x67E;&#x6CC;&#x634; &#x631;&#x648;&#x645;&#x648;&#x646; &#x647;&#x633;&#x62A;.
&#x647;&#x648;&#x627;&#x67E;&#x6CC;&#x645;&#x627;&#x60C; &#x642;&#x637;&#x627;&#x631;&#x60C; &#x627;&#x62A;&#x648;&#x628;&#x648;&#x633;&#x60C; &#x62F;&#x648;&#x686;&#x631;&#x62E;&#x647;&#x60C; &#x645;&#x627;&#x634;&#x6CC;&#x646; &#x648; ...
<br>
&#x627;&#x6AF;&#x647; &#x628;&#x631;&#x627;&#x6CC; &#x631;&#x641;&#x62A;&#x646; &#x639;&#x62C;&#x644;&#x647; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x6CC;&#x645; &#x648; &#x633;&#x631;&#x639;&#x62A; &#x645;&#x644;&#x627;&#x6A9; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x627;&#x634;&#x647;&#x60C; &#x647;&#x648;&#x627;&#x67E;&#x6CC;&#x645;&#x627; &#x645;&#x6CC;&#x62A;&#x648;&#x646;&#x647; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x645;&#x646;&#x627;&#x633;&#x628;&#x6CC; &#x628;&#x627;&#x634;&#x647;. 
&#x627;&#x632; &#x637;&#x631;&#x641;&#x6CC; &#x634;&#x627;&#x6CC;&#x62F; &#x647;&#x632;&#x6CC;&#x646;&#x647; &#x647;&#x645; &#x645;&#x647;&#x645; &#x628;&#x627;&#x634;&#x647; &#x648; &#x62F;&#x631; &#x627;&#x6CC;&#x646;&#x635;&#x648;&#x631;&#x62A; &#x634;&#x627;&#x6CC;&#x62F; &#x642;&#x637;&#x627;&#x631; &#x628;&#x62A;&#x648;&#x646;&#x647; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x645;&#x646;&#x627;&#x633;&#x628; &#x62A;&#x631;&#x6CC; &#x646;&#x633;&#x628;&#x62A; &#x628;&#x647; &#x628;&#x642;&#x6CC;&#x647; &#x628;&#x627;&#x634;&#x647;.</p>
<p>&#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x647; &#x645;&#x62B;&#x644; &#x647;&#x645;&#x6CC;&#x646; &#x631;&#x648;&#x634;&#x647;&#x627;&#x6CC; &#x631;&#x641;&#x62A;&#x646; &#x628;&#x647; &#x645;&#x633;&#x627;&#x641;&#x631;&#x62A; &#x645;&#x6CC;&#x645;&#x648;&#x646;&#x647;&#x61B; &#x647;&#x6CC;&#x686; &#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x647; &#x627;&#x6CC; &#x628;&#x647;&#x62A;&#x631;&#x6CC;&#x646; &#x646;&#x6CC;&#x633;&#x62A;! &#x628;&#x647;&#x62A;&#x631;&#x6CC;&#x646; &#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x647; &#x628;&#x631;&#x627;&#x633;&#x627;&#x633; &#x634;&#x631;&#x627;&#x6CC;&#x637; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x645;&#x6CC;&#x634;&#x647; &#x648; &#x646;&#x645;&#x6CC;&#x634;&#x647; &#x648;&#x627;&#x633;&#x647; &#x647;&#x645;&#x647; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627; &#x6CC;&#x6A9; &#x646;&#x633;&#x62E;&#x647; &#x67E;&#x6CC;&#x686;&#x6CC;&#x62F;!</p>
<h4 id="&#x644;&#x64F;&#x67E;-&#x6A9;&#x644;&#x627;&#x645;">&#x644;&#x64F;&#x67E; &#x6A9;&#x644;&#x627;&#x645;</h4>
<p>&#x622;&#x642;&#x627;&#x6CC; &#x644;&#x6CC;&#x646;&#x648;&#x633; &#x62A;&#x648;&#x631;&#x648;&#x627;&#x644;&#x62F;&#x632; (&#x627;&#x632; &#x627;&#x648;&#x646; &#x6A9;&#x644;&#x647; &#x6AF;&#x646;&#x62F;&#x647; &#x647;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC;!!) &#x645;&#x6CC;&#x6AF;&#x647;: &#xAB;&#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633; &#x647;&#x627;&#x6CC; &#x628;&#x62F; &#x646;&#x6AF;&#x631;&#x627;&#x646; &#x6A9;&#x62F;&#x634;&#x648;&#x646; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x648; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633; &#x647;&#x627;&#x6CC; &#x62E;&#x648;&#x628; &#x646;&#x6AF;&#x631;&#x627;&#x646; &#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x631;&#x62F;&#x646;&#x62F; &#x648; &#x631;&#x648;&#x627;&#x628;&#x637; &#x628;&#x6CC;&#x646; &#x627;&#x648;&#x646;&#x647;&#x627;&#xBB;</p>
<p>&#x641;&#x6A9;&#x631; &#x6A9;&#x646;&#x645; &#x627;&#x6CC;&#x646; &#x62D;&#x631;&#x641;&#x60C; &#x627;&#x648;&#x646; &#x647;&#x645; &#x627;&#x632; &#x6CC;&#x6A9; &#x62E;&#x648;&#x631;&#x647; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x6A9;&#x627;&#x641;&#x6CC; &#x628;&#x627;&#x634;&#x647; &#x62A;&#x627; &#x645;&#x627; &#x647;&#x645; &#x645;&#x62C;&#x627;&#x628; &#x628;&#x647; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x633;&#x627;&#x62E;&#x62A;&#x645;&#x627;&#x646; &#x62F;&#x627;&#x62F;&#x647; &#x647;&#x627; &#x628;&#x634;&#x6CC;&#x645; ((:</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: ساختمان داده ها به زبون آدمیزاد">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"ساختمان داده؟؟؟","level":"1.2","depth":1,"previous":{"title":"ساختمان داده ها به زبون آدمیزاد","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"rtl"},"config":{"plugins":["livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"fa","gitbook":"*","direction":"rtl"},"file":{"path":"WHYDS.md","mtime":"2018-10-11T14:55:21.273Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-10-11T14:55:12.137Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

